In [1]:
import numpy as np
import pandas as pd
from datetime import datetime

In [15]:
file_path = r"C:\Users\Admin\Desktop\JMD327_MainProject\JMD327_JElite\DataEngineering\DataEngineering\DataEngineering\raw_schema\raw_employee.csv"
employee = pd.read_csv(file_path)
employee.head()

,employee_id,employee_name,current_role,skills,dateofbirth,dateofjoining,email,mobile_number,Address
0,421,Glen Wood,junior data engineer,ETL,1984-10-05,2005-05-03,xbrady@example.net,288-735-2226x36271,"509 Martinez Viaduct Apt. 872, Whitebury, NM 2..."
1,488,Mark Underwood,senior data engineer,Data Lakes,1974-03-09,2009-12-24,ywhite@example.org,873-855-6116x181,"82091 Riley Trail Suite 407, Tinaland, AR 46285"
2,272,George Smith,junior data analyst,Tableau,1972-09-18,2012-02-02,blake03@example.net,+1-999-358-4614x42755,"27641 Austin Shores, Port Jose, GU 08041"
3,355,Fred Butler,senior data engineer,Spark,1982-11-03,2010-06-27,randy40@example.com,(754)878-5042,"381 Brian Turnpike, Port Chelseaburgh, VT 01848"
4,35,Kelly Bryant,junior data engineer,Python,1961-11-11,2013-09-14,davisandrew@example.net,001-304-785-9973x8570,"PSC 1740, Box 0313, APO AE 25590"

# Data Cleaning

 Remove the duplicates

In [16]:
# Print the column names to identify the correct name
print("Columns in DataFrame:", employee.columns)

# Count the number of entries in the correct column before dropping duplicates
print("Count of 'employee_id' before dropping duplicates:", employee['employee_id'].count())

# Drop duplicates based on all columns
employee = employee.drop_duplicates()

# Count the number of entries in the correct column after dropping duplicates
print("Count of 'employee_id' after dropping duplicates:", employee['employee_id'].count())

Columns in DataFrame: Index(['employee_id', 'employee_name', 'current_role', 'skills', 'dateofbirth',
       'dateofjoining', 'email', 'mobile_number', 'Address'],
      dtype='object')
Count of 'employee_id' before dropping duplicates: 500
Count of 'employee_id' after dropping duplicates: 500

 To identify the null

In [17]:
employee.isnull().sum()

employee_id      0
employee_name    0
current_role     0
skills           0
dateofbirth      0
dateofjoining    0
email            0
mobile_number    0
Address          0
dtype: int64

 Data type conversion

In [18]:
employee.dtypes

employee_id       int64
employee_name    object
current_role     object
skills           object
dateofbirth      object
dateofjoining    object
email            object
mobile_number    object
Address          object
dtype: object

In [19]:
employee['dateofbirth'] = pd.to_datetime(employee['dateofbirth'])
employee.dtypes

employee_id               int64
employee_name            object
current_role             object
skills                   object
dateofbirth      datetime64[ns]
dateofjoining            object
email                    object
mobile_number            object
Address                  object
dtype: object

In [20]:
employee['dateofjoining'] = pd.to_datetime(employee['dateofjoining'])
employee.dtypes

employee_id               int64
employee_name            object
current_role             object
skills                   object
dateofbirth      datetime64[ns]
dateofjoining    datetime64[ns]
email                    object
mobile_number            object
Address                  object
dtype: object

In [21]:
employee['mobile_number'] = employee['mobile_number'].str.replace(r'\D', '', regex=True)

# Convert 'mobile_number' to numeric type, coercing errors
employee['mobile_number'] = pd.to_numeric(employee['mobile_number'], errors='coerce')

# Drop rows with NaN values in 'mobile_number' if any exist
employee = employee.dropna(subset=['mobile_number'])

# Convert to integer type
employee['mobile_number'] = employee['mobile_number'].astype(int)

# Check the data types after conversion
print("\nData Types After Conversion:")
print(employee.dtypes)

Data Types After Conversion:
employee_id               int64
employee_name            object
current_role             object
skills                   object
dateofbirth      datetime64[ns]
dateofjoining    datetime64[ns]
email                    object
mobile_number             int64
Address                  object
dtype: object

## Data Transformation

In [22]:
employee.head()

,employee_id,employee_name,current_role,skills,dateofbirth,dateofjoining,email,mobile_number,Address
0,421,Glen Wood,junior data engineer,ETL,1984-10-05,2005-05-03,xbrady@example.net,288735222636271,"509 Martinez Viaduct Apt. 872, Whitebury, NM 2..."
1,488,Mark Underwood,senior data engineer,Data Lakes,1974-03-09,2009-12-24,ywhite@example.org,8738556116181,"82091 Riley Trail Suite 407, Tinaland, AR 46285"
2,272,George Smith,junior data analyst,Tableau,1972-09-18,2012-02-02,blake03@example.net,1999358461442755,"27641 Austin Shores, Port Jose, GU 08041"
3,355,Fred Butler,senior data engineer,Spark,1982-11-03,2010-06-27,randy40@example.com,7548785042,"381 Brian Turnpike, Port Chelseaburgh, VT 01848"
4,35,Kelly Bryant,junior data engineer,Python,1961-11-11,2013-09-14,davisandrew@example.net,130478599738570,"PSC 1740, Box 0313, APO AE 25590"

In [23]:
now = pd.Timestamp(datetime.now())

# Calculate years of experience
employee['yearofexperience'] = (now - employee['dateofjoining']).dt.days // 365

In [24]:
employee.head()

,employee_id,employee_name,current_role,skills,dateofbirth,dateofjoining,email,mobile_number,Address,yearofexperience
0,421,Glen Wood,junior data engineer,ETL,1984-10-05,2005-05-03,xbrady@example.net,288735222636271,"509 Martinez Viaduct Apt. 872, Whitebury, NM 2...",19
1,488,Mark Underwood,senior data engineer,Data Lakes,1974-03-09,2009-12-24,ywhite@example.org,8738556116181,"82091 Riley Trail Suite 407, Tinaland, AR 46285",14
2,272,George Smith,junior data analyst,Tableau,1972-09-18,2012-02-02,blake03@example.net,1999358461442755,"27641 Austin Shores, Port Jose, GU 08041",12
3,355,Fred Butler,senior data engineer,Spark,1982-11-03,2010-06-27,randy40@example.com,7548785042,"381 Brian Turnpike, Port Chelseaburgh, VT 01848",14
4,35,Kelly Bryant,junior data engineer,Python,1961-11-11,2013-09-14,davisandrew@example.net,130478599738570,"PSC 1740, Box 0313, APO AE 25590",11

In [25]:
employee.to_csv("prep_employee.csv", index=False)

In [26]:
df= pd.read_csv('prep_employee.csv')
df.head

<bound method NDFrame.head of      employee_id   employee_name              current_role  \
0            421       Glen Wood      junior data engineer
1            488  Mark Underwood      senior data engineer
2            272    George Smith       junior data analyst
3            355     Fred Butler      senior data engineer
4             35    Kelly Bryant      junior data engineer
..           ...             ...                       ...
495          411  Melanie Holder      senior data engineer
496          249   Ryan Marshall  senior software engineer
497           85      Cody Baker      junior data engineer
498           47    Haley Curtis     senior data scientist
499          240   Rebecca Perez       junior data analyst

                          skills dateofbirth dateofjoining  \
0                            ETL  1984-10-05    2005-05-03
1                     Data Lakes  1974-03-09    2009-12-24
2                        Tableau  1972-09-18    2012-02-02
3                          Spark  1982-11-03    2010-06-27
4                         Python  1961-11-11    2013-09-14
..                           ...         ...           ...
495                       Hadoop  1976-05-09    2019-11-10
496                       DevOps  1977-07-21    2017-10-19
497                          ETL  1974-07-12    2004-11-17
498  Natural Language Processing  1970-07-06    2012-02-19
499                        Excel  1961-08-26    2005-01-04

                         email     mobile_number  \
0           xbrady@example.net   288735222636271
1           ywhite@example.org     8738556116181
2          blake03@example.net  1999358461442755
3          randy40@example.com        7548785042
4      davisandrew@example.net   130478599738570
..                         ...               ...
495  emilycrawford@example.org   872352706978436
496     browndavid@example.org     3847862032057
497   caitlinperry@example.org    96225801730266
498        april83@example.org  1381765874989730
499     sarahpatel@example.com       17743092358

                                               Address  yearofexperience
0    509 Martinez Viaduct Apt. 872, Whitebury, NM 2...                19
1      82091 Riley Trail Suite 407, Tinaland, AR 46285                14
2             27641 Austin Shores, Port Jose, GU 08041                12
3      381 Brian Turnpike, Port Chelseaburgh, VT 01848                14
4                     PSC 1740, Box 0313, APO AE 25590                11
..                                                 ...               ...
495             195 Donald Rapid, Jacobsberg, MP 46142                 4
496                   PSC 0251, Box 9756, APO AA 19442                 6
497         391 Duncan Gateway, East Natalie, WV 96438                19
498      075 Allen Divide, New Meaganchester, MI 80616                12
499  5990 Steven Greens Apt. 504, Powersshire, KS 0...                19

[500 rows x 10 columns]>

In [27]:
employee.to_csv("prep_employee.csv", index=False)